import React from "react";
import styles from "./Footer.module.css";
import logo from "../.././img/headerIMG/logoHeader.png";


export const Footer = () => {
  return (
    <footer className={styles.footer}>
      <div className="container">
        <div className={styles.footrBlock}>
          <div className={styles.buyers}>
            <h3 className={styles.title}>Покупателям</h3>
            <ul>
              <li className={styles.item}>
                <a  href="#">
                  Как это работает
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Защита покупателя
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Условия оплаты
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Условия использования
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Регистрация аккаунта
                </a>
              </li>
            </ul>
            <a href="#"><img src={logo} alt="logo" className={styles.logo} /></a>
          </div>
          <div className={styles.suppliers}>
            <h3 className={styles.title}>Поставщикам</h3>
            <ul>
              <li className={styles.item}>
                <a  href="#">
                  Как стать продавцом
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Правила участия
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Личный кабинет продавца
                </a>
              </li>
            </ul>
          </div>
          <div className={styles.infoCompany}>
            <h3 className={styles.title}>О компании</h3>
            <ul>
              <li className={styles.item}>
                <a  href="#">
                  О PlaceMik
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Новости
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Часто задаваемые вопросы
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Служба поддержки
                </a>
              </li>
              <li className={styles.item}>
                <a  href="#">
                  Сообщить о нарушении авторских прав
                </a>
              </li>
            </ul>
          </div>
          <div className={styles.inputBlock}>
            <h3 className={styles.titleInput}>Хотите быть в курсе последних новостей и акций? </h3>
            <div className={styles.inputEmailBlock}>
              <input className={styles.inputText} type="text" placeholder="konstantinkonstantinov@yandex.ru"/>
              <button type="submit" className={styles.inputButton}>Подписаться</button>
            </div>
            <div className={styles.socialBlock}>
              <h3 className={styles.title}>Мы в соцсетях</h3>
            <div className={styles.social}>
            <a className={styles.vk} href="vk">
                <svg
                  width="29"
                  height="26"
                  viewBox="0 0 29 26"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0_111_2184)">
                    <path
                      d="M27.489 6.24695C27.6689 5.6366 27.489 5.18738 26.6238 5.18738H23.7606C23.0314 5.18738 22.696 5.57312 22.5161 6.00281C22.5161 6.00281 21.0578 9.57214 18.9967 11.8866C18.3307 12.5555 18.0245 12.7704 17.6599 12.7704C17.48 12.7704 17.2029 12.5555 17.2029 11.9452V6.24695C17.2029 5.51453 16.9988 5.18738 16.396 5.18738H11.8946C11.4376 5.18738 11.1654 5.52917 11.1654 5.84656C11.1654 6.53992 12.196 6.70105 12.3029 8.65417V12.8925C12.3029 13.8202 12.1376 13.9911 11.7731 13.9911C10.8008 13.9911 8.43834 10.4071 7.03834 6.30554C6.7564 5.50964 6.47931 5.18738 5.74529 5.18738H2.88209C2.06542 5.18738 1.90015 5.57312 1.90015 6.00281C1.90015 6.76453 2.87237 10.5487 6.42584 15.5487C8.7932 18.9618 12.1279 20.8124 15.1613 20.8124C16.9842 20.8124 17.2078 20.4022 17.2078 19.6942C17.2078 16.4325 17.0425 16.1249 17.9564 16.1249C18.3793 16.1249 19.1085 16.3397 20.8099 17.9852C22.7543 19.9384 23.0751 20.8124 24.164 20.8124H27.0272C27.8439 20.8124 28.2571 20.4022 28.0189 19.5917C27.4745 17.8876 23.7946 14.3817 23.6293 14.1473C23.2064 13.6005 23.3279 13.3563 23.6293 12.868C23.6342 12.8632 27.1293 7.92175 27.489 6.24695V6.24695Z"
                      fill="white"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_111_2184">
                      <rect
                        width="28"
                        height="25"
                        fill="white"
                        transform="translate(0.99585 0.5)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </a>
              <a className={styles.instagramm} href="instagramm">
                <svg
                  width="26"
                  height="26"
                  viewBox="0 0 26 26"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0_111_2180)">
                    <path
                      d="M25.9719 7.85007C25.9133 6.52172 25.6985 5.6085 25.3908 4.81717C25.0734 3.9772 24.585 3.22518 23.9451 2.60002C23.32 1.96513 22.563 1.47179 21.7328 1.15931C20.9369 0.851593 20.0284 0.636784 18.7001 0.578217C17.3618 0.514689 16.9369 0.5 13.5427 0.5C10.1485 0.5 9.72366 0.514689 8.39035 0.573257C7.06201 0.631824 6.14878 0.846824 5.35765 1.15435C4.51749 1.47179 3.76546 1.96017 3.1403 2.60002C2.50541 3.22518 2.01227 3.98216 1.69959 4.8124C1.39188 5.6085 1.17707 6.51676 1.1185 7.84511C1.05497 9.18338 1.04028 9.60823 1.04028 13.0024C1.04028 16.3967 1.05497 16.8215 1.11354 18.1548C1.17211 19.4832 1.38711 20.3964 1.69482 21.1877C2.01227 22.0277 2.50541 22.7797 3.1403 23.4049C3.76546 24.0398 4.52245 24.5331 5.35269 24.8456C6.14878 25.1533 7.05704 25.3681 8.38558 25.4267C9.7187 25.4854 10.1437 25.4999 13.538 25.4999C16.9322 25.4999 17.357 25.4854 18.6903 25.4267C20.0187 25.3681 20.9319 25.1533 21.723 24.8456C23.4032 24.196 24.7315 22.8677 25.3811 21.1877C25.6886 20.3916 25.9036 19.4832 25.9622 18.1548C26.0207 16.8215 26.0354 16.3967 26.0354 13.0024C26.0354 9.60823 26.0305 9.18338 25.9719 7.85007ZM23.7206 18.0571C23.6668 19.2781 23.4617 19.9374 23.2908 20.3769C22.8707 21.4661 22.0063 22.3304 20.9172 22.7505C20.4777 22.9215 19.8136 23.1265 18.5974 23.1801C17.2788 23.2389 16.8833 23.2534 13.5477 23.2534C10.212 23.2534 9.8116 23.2389 8.49776 23.1801C7.27681 23.1265 6.61751 22.9215 6.17797 22.7505C5.63598 22.5502 5.14265 22.2328 4.74222 21.8176C4.3271 21.4123 4.00965 20.9239 3.80934 20.3819C3.63841 19.9424 3.43333 19.2781 3.37972 18.0621C3.32096 16.7435 3.30647 16.3478 3.30647 13.0122C3.30647 9.67652 3.32096 9.27609 3.37972 7.96243C3.43333 6.74149 3.63841 6.08218 3.80934 5.64264C4.00965 5.10047 4.3271 4.60732 4.74718 4.2067C5.15238 3.79158 5.64075 3.47414 6.18293 3.27402C6.62247 3.10309 7.28673 2.89801 8.50272 2.84421C9.82133 2.78564 10.217 2.77095 13.5525 2.77095C16.8931 2.77095 17.2885 2.78564 18.6024 2.84421C19.8233 2.89801 20.4826 3.10309 20.9222 3.27402C21.4642 3.47414 21.9575 3.79158 22.3579 4.2067C22.773 4.61209 23.0905 5.10047 23.2908 5.64264C23.4617 6.08218 23.6668 6.74626 23.7206 7.96243C23.7792 9.28105 23.7939 9.67652 23.7939 13.0122C23.7939 16.3478 23.7792 16.7385 23.7206 18.0571Z"
                      fill="white"
                    />
                    <path
                      d="M13.542 6.58032C9.99653 6.58032 7.11987 9.45679 7.11987 13.0025C7.11987 16.5482 9.99653 19.4246 13.542 19.4246C17.0877 19.4246 19.9642 16.5482 19.9642 13.0025C19.9642 9.45679 17.0877 6.58032 13.542 6.58032ZM13.542 17.1684C11.2419 17.1684 9.37613 15.3028 9.37613 13.0025C9.37613 10.7021 11.2419 8.83659 13.542 8.83659C15.8424 8.83659 17.7079 10.7021 17.7079 13.0025C17.7079 15.3028 15.8424 17.1684 13.542 17.1684Z"
                      fill="white"
                    />
                    <path
                      d="M21.7177 6.32643C21.7177 7.15438 21.0464 7.82571 20.2183 7.82571C19.3903 7.82571 18.719 7.15438 18.719 6.32643C18.719 5.49828 19.3903 4.82715 20.2183 4.82715C21.0464 4.82715 21.7177 5.49828 21.7177 6.32643Z"
                      fill="white"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_111_2180">
                      <rect
                        width="25"
                        height="25"
                        fill="white"
                        transform="translate(0.99585 0.5)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </a>
              <a className={styles.fb} href="fb">
                <svg
                  width="17"
                  height="26"
                  viewBox="0 0 17 26"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0_111_2178)">
                    <path
                      d="M14.9529 14.5625L15.6639 10.0381H11.2184V7.10205C11.2184 5.86426 11.8394 4.65771 13.8304 4.65771H15.8514V0.805664C15.8514 0.805664 14.0174 0.5 12.2639 0.5C8.60288 0.5 6.20988 2.66699 6.20988 6.58984V10.0381H2.14038V14.5625H6.20988V25.5H11.2184V14.5625H14.9529Z"
                      fill="white"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_111_2178">
                      <rect
                        width="16"
                        height="25"
                        fill="white"
                        transform="translate(0.99585 0.5)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </a>
            </div>
            </div>
            <div className={styles.footelBottomText}>
            © PlaceMik.ru, 2021
            </div>
          </div>
        </div>
      </div>
    </footer>
  );
};
